[{"y": 10, "e": "AD", "t": "year", "f": ["Differentiation of localized Teutonic tribes of the Irminones.", "Senatus consultum Silanianum is adopted.", "The Euthydemid dynasty, a Greek dynasty in Bactria, is brought to an end.", "The usurper Wang Mang (who rules during a brief interregnum known as the Xin dynasty) outlaws the private purchase and use of crossbows. Despite this, Liu Xiu, the later Emperor Guangwu of Han, buys crossbows in the winter of  to aid the rebellion of his brother Liu Yan (styled Bosheng) and Li Tong.", "According to the Gospel of Luke, Jesus visits Herod's Temple and gets lost."]}, {"y": 11, "e": "AD", "t": "year", "f": ["Germania Inferior and the Rhine are secured by Germanicus.", "Emperor Augustus abandons his plan to create a defensive border at the Elbe, in order to reinforce the Roman defenses along the Rhine and the Danube.", "An edict is issued effecting an empire-wide ban on divinatory practices, especially astrology. The edict requires any consultation between a customer and a practitioner to be conducted with at least one third party witness present, and bans inquiry into anyone's death.", "Artabanus II becomes ruler of Parthia.", "Satakarni begins his reign as Emperor of the Andhra Empire (–)."]}, {"y": 12, "e": "AD", "t": "year", "f": ["Annius Rufus is appointed Prefect of Judea.", "Augustus orders a major invasion of Germany beyond the Rhine.", "Quirinius returns from Judea to become a counselor to Tiberius.", "The Armenian Artaxiad dynasty is overthrown by the Romans.", "Ovid stops writing Fasti, because of the lack of resources (being far from the libraries of Rome).  He completes  books that detail festivals found in the Roman calendar."]}, {"y": 13, "e": "AD", "t": "year", "f": ["Emperor Augustus initiates his third census of the Roman Empire after  years.", "Abgarus of Edessa is reinstalled as king of Osroene.", "The Senate passes a senatus consultum restricting the reduced Vigintisexviri to the Ordo Equester.", "Last year (3rd) of Shijianguo era of the Chinese Xin Dynasty (considered the lucky number of those from the Chinese Xin Dynasty).", "Strabo publishes his book on the shape of the Earth."]}, {"y": 14, "e": "AD", "t": "year", "f": ["Augustus' third (and final) -year census of the Roman Empire reports a total of ,, citizens.", "August  – Augustus, the first Roman emperor, dies and is declared to be a god.", "September  – Tiberius succeeds his stepfather Augustus as Roman emperor.", "Legions on the Rhine mutiny after the death of Augustus; Germanicus restores discipline amongst the legions.", "Germanicus is appointed commander of the forces in Germany, beginning a campaign that will end in ."]}, {"y": 15, "e": "AD", "t": "year", "f": ["Early (approx.) – Emona (on the site of modern-day Ljubljana) is founded by Legio XV Apollinaris.", "May – As part of his campaign against the Germanic peoples, Germanicus captures Thusnelda, wife of Arminius.", "Summer – Germanicus launches a two-pronged  attack from Vetera and Moguntiacum. On his return journey, he recaptures the aquila of Legio XIX and visits the battlefield of the Teutoburg Forest. Germanicus arranges the burial for the remains of Varus' army.", "Varna (Odessus), on the Bulgarian Black Sea Coast, is annexed to the Roman province of Moesia.", "In Rome, the election of magistrates passes from the people to the Emperor and the Senate."]}, {"y": 16, "e": "AD", "t": "year", "f": ["A Roman army of , men commanded by Germanicus gains a great victory at Idistaviso, defeating the German war chief Arminius, and recovering the lost eagles of Varus' legions.", "Germanicus employs the North Sea fleet to avoid dangerous rivers, embarking an army in the Rhine Delta, aboard circa , ships. He defeats the Germans at the Amisius river estuary and the Weser, but during its return, the Roman fleet is partially destroyed by storms.", "Vonones, the beleaguered king of Armenia, is summoned to Syria, by Roman governor Creticus Silanus.", "Ovid's \"Epistulae ex Ponto\" appears."]}, {"y": 17, "e": "AD", "t": "year", "f": ["May  – Germanicus returns to Rome as a conquering hero; he celebrates a triumph for his victories over the Cherusci, Chatti and other Germanic tribes west of the Elbe.", "Emperor Tiberius sends Germanicus to the east, in order to lead a military campaign against Parthia.", "Cappadocia (Asia Minor) becomes a Roman province.", "Lucius Aelius Sejanus becomes Praetorian prefect.", "Tacfarinas, Numidian deserter from the Roman army, begins a guerrilla war against the Romans. He leads his own Musulamii tribe and a coalition of Berbers, attacking the Limes Tripolitanus, a fortified zone (limes) of the Roman Empire in Africa."]}, {"y": 18, "e": "AD", "t": "year", "f": ["A vexillatio (sub-unit or detachment) of Legio III Augusta is destroyed by an ambush in Africa.", "Winter – Germanicus Caesar arrives in Syria, as new commander-in-chief for the Roman East.", "Gnaeus Calpurnius Piso, governor of Syria, ignores the order of Germanicus to send Syrian-based legions, including Legio VI Ferrata and Legio X Fretensis, to Armenia to back him in his planned coronation of Artaxias III.", "Germanicus concludes a peace treaty with Artabanus II of Parthia, in which he is recognized as king and friend of Rome.", "After a flooding of the Yellow River in China, farmers are forced to rebel. Emperor Wang Mang reacts by sending an army (some , men) against the agrarian rebels. The rebel leaders, concerned that during battle it will become impossible to tell friend from foe, order that their men color their eyebrows red – and this is where the name Chimei (\"The Red Eyebrows\") comes from."]}, {"y": 19, "e": "AD", "t": "year", "f": ["Maroboduus, king of the Marcomanni, is deposed by Catualda.  This ends the threat to the Romans from Germanic tribes until the reign of Marcus Aurelius. Rome places them under its protection.", "Germanicus Julius Caesar, commander in chief of the Roman legions in the East and beloved by the legionaries, falls ill and dies. On his deathbed he accuses Gnaeus Calpurnius Piso, the governor of Syria, of poisoning him.", "Emperor Tiberius expels the Egyptians from Rome, and deports , Jews from Sicily.", "Agrippina the Elder accuses Gnaeus Calpurnius Piso of having assassinated her husband Germanicus Julius Caesar in Antioch. However, there is no credible evidence and the charge is never proven. (In ancient times, when medical science was not advanced, poison was usually suspected whenever a young, healthy person died suddenly. There was no way to pinpoint and trace the substance after death; therefore, it was considered a quick, easy and non-traceable form of homicide.)", "A triumphal arch is built for Germanicus Julius Caesar in Saintes."]}, {"y": 21, "e": "AD", "t": "year", "f": ["The Aedui revolt under Julius Florus and Julius Sacrovir; the revolt is suppressed by Gaius Silius.", "Emperor Tiberius is a Roman Consul for the fourth time.", "The Romans create a buffer state in the territory of the Quadi, in southern Slovakia.", "Barracks are constructed for the Praetorian Guard, on the Quirinal (located on the Seven Hills of Rome).", "King Daeso of Dongbuyeo is killed in battle against the armies of Goguryeo, led by its third ruler, King Daemusin."]}, {"y": 23, "e": "AD", "t": "year", "f": ["Greek geographer Strabo publishes Geographica, a work covering the world known to the Romans and Greeks at the time of Emperor Augustus – it is the only such book to survive from the ancient world.", "Emperor Tiberius' son Drusus Julius Caesar dies.  From that point forward, Tiberius seems to lose interest in the Empire and occupies himself with the pursuit of pleasure.", "Lucius Aelius Sejanus begins to dominate the Roman Senate and Tiberius, after the death of Drusus.", "Liu Xuan, a descendant of the Han dynasty royal family and leader of insurgents against the Xin dynasty, proclaims himself emperor against Wang Mang.", "July – After being under siege for two months, about , insurgents under Liu Xiu defeat , of Wang Mang's troops in the Battle of Kunyang, ushering in the fall of Wang Mang's Xin dynasty and restoration of the Han dynasty."]}, {"y": 24, "e": "AD", "t": "year", "f": ["June  – The terms of Servius Cornelius Cethegus and Lucius Visellius Varro as Roman consuls expire. During their terms, two laws pertaining to slavery had been  passed, the lex Visellia de iure Quiritium Latinorum qui inter vigiles militaverant granting freed slaves Roman citizenship after six years service, and the Lex Visellia de poenis libertinorum qui ingenuorum honores usurpabant which penalized non-citizens who falsely claimed to be ingenui or freeborn Romans.", "July  – Midway through the Roman year  A.U.C., Gaius Calpurnius Aviola and  Publius Lentulus Scipio begin the new consular year as the new suffect consuls.", "The Roman war against Numidia and Mauretania ends with the annexation of the two African kingdoms.", "The revolt of Tacfarinas revolt in Africa is repressed.", "The Senate expels actors from Rome.The factual accuracy of part of this article is disputed. The dispute is about At least if quoted correctly here Tacitus . says this event took place in .. Please help to ensure that disputed statements are reliably sourced.  See the relevant discussion on the [[Talk:#At least if quoted correctly here Tacitus . says this event took place in .|talk page]]. (July ) (Learn how and when to remove this message)"]}, {"y": 25, "e": "AD", "t": "year", "f": ["Emperor Tiberius settles a dispute between Messenia and Sparta over the Ager Dentheliales on Mount Taygetus, awarding the land to Messenia.", "Lucius Aelius Sejanus unsuccessfully attempts to marry Livilla.", "August  – The Han dynasty is restored in China as Liu Xiu proclaims himself Emperor Guangwu of Han, starting the Jianwu era (until ).", "November  – Luoyang becomes the capital of the Houhan or Eastern Han dynasty."]}, {"y": 26, "e": "AD", "t": "year", "f": ["Pontius Pilate is appointed as prefect of Judea.", "Emperor Tiberius retires to Capri, leaving the Praetorian Guard under Lucius Aelius Sejanus in charge of the Roman Empire and the city of Rome.", "Romans crush an uprising of Thracian tribesmen.", "Jesus is baptized in the Jordan River by John the Baptist and begins his public ministry, according to some scholars."]}, {"y": 27, "e": "AD", "t": "year", "f": ["A fire breaks out in Rome.", "A poorly built amphitheatre in Fidenae collapses, killing , of the , spectators.", "Using the dates and ranges listed in the Gospel of Luke, this year can be established as when John the Baptist begins preaching in the Jordan. It is also likely that Jesus was baptised by John in the final months of this year before his temptation and the first of three Passovers listed in the Gospel of John.", "An Arc of Triumph is erected in Rimini, in honor of the former Emperor Augustus.", "Possible date of the Baptism of Jesus by John the Baptist (another possibility is )."]}, {"y": 28, "e": "AD", "t": "year", "f": ["Roman legions in Germania are transported by fleet to the fortress of Flevum on the Rhine, to operate against the rebellious Frisians.", "The Frisians negotiate a treaty with the Roman Empire at the River Rhine.", "Frisians revolt against Roman authorities, hanging tax collectors and besieging a local fort. Frisians achieve victory and gain considerable prestige among other local tribes.", "King Daru of Baekje succeeds to the throne of Baekje in the Korean peninsula.", "According to the Gospel of Luke (Luke :-), the ministries of John the Baptist and Jesus begin at the earliest in this year, and more likely in ."]}, {"y": 29, "e": "AD", "t": "year", "f": ["Agrippina the Elder is exiled to the island of Pandataria, and her sons (except Caligula) are imprisoned by Lucius Aelius Sejanus.", "Aulus Plautius, later military leader of the invasion of Britain under Emperor Claudius, becomes suffect consul alongside Lucius Nonius Asprenas.", "According to the Gospel of Luke (Luke :-), the ministries of John the Baptist and Jesus is thought to have started this year. Jesus is baptized by John the Baptist.", "Jesus executed by crucifixion, according to Roman Catholic tradition and Tertullian's chronology."]}, {"y": 30, "e": "AD", "t": "year", "f": ["The Kushan Empire is founded (approximate date).", "Agrippina the Elder (the wife of Germanicus) and two of her sons, Nero Julius Caesar and Drusus Caesar, are arrested and exiled on orders of Lucius Aelius Sejanus (the prefect of the Praetorian Guard), and later starved to death in suspicious circumstances. In Sejanus's purge of Agrippina the Elder and her family, her son Caligula, and her three daughters, Agrippina the Younger, Julia Drusilla and Julia Livilla are the only survivors.", "Phaedrus translates Aesop's fables, and composes some of his own.", "Velleius Paterculus writes the general history of the countries known in Antiquity.", "April (Good Friday) – Jesus is crucified (according to one dating scheme).   He is later reported alive by his disciples."]}, {"y": 33, "e": "AD", "t": "year", "f": ["April  – According to Colin Humphrey's account, Jesus of Nazareth's Last Supper takes place.", "Emperor Tiberius founds a credit bank in Rome.", "A financial crisis hits Rome, due to poorly chosen fiscal policies. Land values plummet, and credit is increased. These actions lead to a lack of money, a crisis of confidence, and much land speculation. The primary victims are senators, knights and the wealthy. Many aristocratic families are ruined.", "Although the usurpation of Wang Mang and the Chimei Rebellion are behind him, Emperor Guangwu now faces a new threat to the Han dynasty: the Rebellion of Gongsun Shu in the Sichuan province. Gongsun's naval forces are unsuccessful against Han General Cen Peng, so Gongsun decides to fortify his position by blockading the entire Yangtze River with a large floating pontoon bridge, complete with floating fortified posts. After Cen Peng is unable to break through, he constructs several \"castle ships\" with high ramparts and ramming vessels known as \"colliding swoopers\", which break through Gongsun's lines and allow Cen to quell his rebellion. Gongsun Shu is totally defeated three years later."]}, {"y": 34, "e": "AD", "t": "year", "f": ["The Roman aqueduct Pont du Gard is constructed, running for  km, ending at Nîmes (approximate date).", "Naevius Sutorius Macro gains favour in the Roman Empire by prostituting his wife Ennia Thrasylla to Caligula.", "Rome intervenes in Armenia (–).", "The original inhabitants of Dacia revolt against the Sarmatian tribe of Iazyges, who had enslaved them.", "Stephen, one of the original seven deacons of the Christian Church, is martyred for his faith (possible date)."]}, {"y": 35, "e": "AD", "t": "year", "f": ["Emperor Tiberius names Caligula (aka Gaius) and Gamellus, a grandson, as co-heirs.", "Pliny the Elder is brought to Rome before this year.", "Tiridates III becomes king of Parthia (until )."]}, {"y": 36, "e": "AD", "t": "year", "f": ["December  – Wu Han commands the forces of Emperor Guang Wu of the Eastern Han to conquer the separatist Chengjia Empire, reuniting China.", "Pontius Pilate is recalled to Rome, after putting down a Samaritan uprising.", "Lucius Vitellius defeats Artabanus III of Parthia in support of another claimant to the throne, Tiridates III.", "Herod Antipas suffers major losses in a war with Aretas IV of Nabatea, provoked partly by Antipas' divorce of Aretas' daughter. According to Josephus, Herod's defeat was popularly believed to be divine punishment for his execution of John the Baptist. Emperor Tiberius orders his governor of Syria, Vitellius, to capture or kill Aretas, but he is reluctant to support Herod and abandons his campaign upon Tiberius' death in .", "Marcellus becomes governor of Judaea and Samaria."]}, {"y": 37, "e": "AD", "t": "year", "f": ["March  – The Roman Senate annuls Tiberius's will, and proclaims Caligula as Roman Emperor, nullifying the joint claim of Tiberius Gemellus. Caligula's attempt to have himself deified creates friction between himself and the Senate.", "October – Caligula becomes seriously ill, or perhaps is poisoned. He recovers from his illness, but Caligula turns toward the diabolical: he starts to kill off those who are close to him, whom he sees as a serious threat.", "Abilene is granted to King Agrippa I.", "April  – An earthquake destroys Antioch.", "Peter the Apostle founds the Church of Antioch (approximate date)."]}, {"y": 38, "e": "AD", "t": "year", "f": ["Claudius and Messalina are most likely married at this point in time.", "Apion heads a deputation to Emperor Caligula, to complain about the Jews in Alexandria.", "An anti-Jewish riot breaks out in Alexandria, during a visit by King Herod Agrippa I; the mob wants to place statues of Caligula in every synagogue.", "An epidemic breaks out in K'aui-chi, causing many deaths. Imperial official Ch'ung-li I provides medicines that save many lives.", "Phaedrus writes his popular collection of fables."]}, {"y": 39, "e": "AD", "t": "year", "f": ["Tigellinus, minister and favorite of the later Roman emperor Nero, is banished for adultery with Caligula's sisters.", "Gaius Caesar Augustus Germanicus (Caligula) and Gnaeus Domitius Corbulo become Roman consuls.", "Caligula orders a floating bridge to be built using ships as pontoons, stretching for two miles from Baiae to the neighboring port of Puteoli.", "Agrippa I, king of Judaea, successfully accuses Herod Antipas, tetrarch of Galilee and Perea, of conspiracy against Caligula. Antipas is exiled and Agrippa receives his territory.", "Legio XV Primigenia and XXII Primigenia are levied by Caligula for the German frontier."]}, {"y": 40, "e": "AD", "t": "year", "f": ["Emperor Caligula is consul without colleague.", "Caligula starts on a campaign to conquer Britain, which fails miserably. He declares himself victorious regardless.", "Noricum and Mauretania are incorporated into the Roman Empire.", "Caligula reforms the principatus into a Hellenistic Autocracy. He distributes honors carelessly, declares himself a god and orders that all the heads of the Greek deity statues be replaced by his. He also appoints his horse, Incitatus,  a senator.", "Construction begins on the Pont du Gard aqueduct in Gallia Narbonensis (approximate date)."]}, {"y": 41, "e": "AD", "t": "year", "f": ["January \nCaligula, known for his eccentricity and cruel despotism, is assassinated by his disgruntled Praetorian Guards.\nClaudius succeeds his nephew, Caligula, as emperor.", "Caligula, known for his eccentricity and cruel despotism, is assassinated by his disgruntled Praetorian Guards.", "Claudius succeeds his nephew, Caligula, as emperor.", "January  – After a night of negotiation, Claudius is accepted as emperor by the Senate.", "Claudius makes Agrippa king of Judea."]}, {"y": 42, "e": "AD", "t": "year", "f": ["Romans take control of Ceuta, a port city on the North African side of the Strait of Gibraltar.", "The territories of the current Algeria and Morocco become a Roman province.", "Dalmatian legate Lucius Arruntius Camillus Scribonianus revolts, but his troops defect, and his rebellion quickly withers.", "Claudius begins construction of Portus, a harbour bearing a lighthouse on the right bank of the Tiber.", "Suro becomes the first king of Geumgwan Gaya, on the Korean Peninsula."]}, {"y": 43, "e": "AD", "t": "year", "f": ["Roman conquest of Britain:\nMay – Aulus Plautius, crossing (probably) from Boulogne (Bononia) in the Classis Britannica, lands with four Roman legions (, men) and the same number of auxiliaries at Rutupiae (probably modern Richborough) on the east coast of Kent. General (future emperor) Vespasian plays a major role in the defeat of the Britons led by the brothers Caratacus and Togodumnus (leaders of the Catuvellauni) in the -day Battle of the Medway (probably at the river near Rochester) and the Romans drive them back to and across the River Thames; Togodumnus dies soon after. Plautius halts at the Thames and sends for the Emperor.\nSeptember – Emperor Claudius, who arrives with reinforcements including war elephants, leads the march on Camulodunum (modern Colchester). Eleven British kings, probably including those of the Iceni and Brigantes, submit without a fight. Plautius becomes the first Governor of Roman Britain.\nVespasian begins to subdue the south-west.\nThe Romans begin to construct forts, such as at Peterborough, and a road that later becomes Ermine Street.\nThe Romans capture a Brythonic settlement at Kent and rename it Durovernum Cantiacorum (modern Canterbury); and establish a Roman fort to guard the crossing of the Kentish River Stour.\nRoman London (Londinium) is established on the Thames.", "May – Aulus Plautius, crossing (probably) from Boulogne (Bononia) in the Classis Britannica, lands with four Roman legions (, men) and the same number of auxiliaries at Rutupiae (probably modern Richborough) on the east coast of Kent. General (future emperor) Vespasian plays a major role in the defeat of the Britons led by the brothers Caratacus and Togodumnus (leaders of the Catuvellauni) in the -day Battle of the Medway (probably at the river near Rochester) and the Romans drive them back to and across the River Thames; Togodumnus dies soon after. Plautius halts at the Thames and sends for the Emperor.", "September – Emperor Claudius, who arrives with reinforcements including war elephants, leads the march on Camulodunum (modern Colchester). Eleven British kings, probably including those of the Iceni and Brigantes, submit without a fight. Plautius becomes the first Governor of Roman Britain.", "Vespasian begins to subdue the south-west.", "The Romans begin to construct forts, such as at Peterborough, and a road that later becomes Ermine Street."]}, {"y": 44, "e": "AD", "t": "year", "f": ["Emperor Claudius returns from his British campaign in triumph, the southeast part of Britannia now held by the Roman Empire, but the war will rage for another decade and a half.", "Boudicca marries Prasutagus, king of the British Celtic tribe the Iceni (doubtful).", "Mauretania becomes a Roman province.", "The Isle of Rhodes returns to the Roman Empire.", "Judaea is controlled by Roman governors."]}, {"y": 45, "e": "AD", "t": "year", "f": ["Juvavum (modern Salzburg) is awarded the status of a Roman municipium.", "Emperor Claudius expels the Jews from Rome (estimated date, more probably later, -).", "Claudius founds Savaria, today the Hungarian city of Szombathely.", "The Senate holds consultations regarding real estate speculation in Rome.", "Chinese general Ma Yuan conducts an expedition against the Xiongnu and the Xianbei (in Manchuria)."]}, {"y": 46, "e": "AD", "t": "year", "f": ["The settlement at Celje gets municipal rights, and is named municipium Claudia Celeia.", "Dobruja is annexed into Roman Moesia.", "A census shows that there are more than ,, Roman citizens.", "After the death of its king, Thracia becomes a Roman province.", "Rome and its northeast border are reunited by the Danube Road."]}, {"y": 47, "e": "AD", "t": "year", "f": ["Claudius revives the censorship and ludi saeculares, and organises the order of the Haruspices, with  members.", "Gnaeus Domitius Corbulo is made commander of the Roman army in Germania Inferior. He conquers the Chauci and fights against the Cherusci and Frisians.", "Cauci pirates led by the Roman deserter Gannascus ravage the Gallic coast; Corbulo uses the Rhine fleet against them. The Frisian revolt is suppressed.", "Publius Ostorius Scapula replaces Aulus Plautius as governor of Britain. The south-east of the island is now a Roman province, while certain states on the south coast are ruled as a nominally independent client kingdom by Tiberius Claudius Cogidubnus, whose seat is probably at Fishbourne near Chichester. Ostorius immediately faces incursions from unconquered areas, which he puts down.", "Corbulo orders the construction of the canal Fossa Corbulonis, between the Rhine and Meuse in the Netherlands, which connects the city Forum Hadriani (Voorburg)."]}, {"y": 48, "e": "AD", "t": "year", "f": ["Emperor Claudius invests Agrippa II with the office of superintendent of the Temple in Jerusalem.", "After the execution of his wife Messalina, Claudius gets senatorial approval to marry his niece, Agrippina the Younger.", "Publius Ostorius Scapula, governor of Britain, announces his intention to disarm all Britons south and east of the Trent and Severn. The Iceni, an independent, allied kingdom within that area, revolt but are defeated. Ostorius then moves against the Deceangli in north Wales, but is forced to abandon the campaign to deal with a revolt among the allied Brigantes.", "Gallic nobles are admitted to the Roman Senate. Claudius grants the rights of citizenship to the Aedui.", "Emperor Guang Wu of Han, restores Chinese domination of Inner Mongolia. The Xiongnu are made confederates and guard the Northern border of the empire."]}, {"y": 49, "e": "AD", "t": "year", "f": ["Emperor Claudius marries his niece Agrippina the Younger (approximate date), and most of the real power falls to Agrippina.", "Seneca the Younger becomes Nero's tutor.", "Melankomas is the boxing champion, at the 207th Olympic Games.", "Likely date for the expulsion of the Jews from Rome.", "Nero becomes engaged to Claudia Octavia, daughter of Claudius."]}, {"y": 50, "e": "AD", "t": "year", "f": ["Cologne is raised to the status of a city.", "Utrecht is founded, and a Roman fortification (castellum) is constructed at the Rhine border in the present-day Netherlands.", "In Judaea, a Roman soldier seizes and burns a Torah scroll. Procurator Cumanus has the culprit beheaded, calming down the Jews and delaying for almost two decades the outbreak of their revolt.", "In Britain, governor Publius Ostorius Scapula begins his campaign against the recalcitrant Silures of south Wales, who are led by the former Catuvellaunian prince Caratacus. London (Londinium), Exeter (Isca Dumnoniorum), Tripontium (near modern Rugby) and the fort of Manduessedum (near modern Atherstone) are founded (approximate date).", "Roman emperor Claudius appoints Agrippa II governor of Chalcis."]}, {"y": 51, "e": "AD", "t": "year", "f": ["Emperor Claudius and future emperor Titus Flavius Vespasianus are Roman Consuls.", "Burrus, praetorian prefect (–), charges Seneca with the education of Nero.", "In Britain, governor Publius Ostorius Scapula defeats Caratacus and the Silures in the territory of the Ordovices in central Wales. Caratacus seeks sanctuary with Cartimandua, queen of the Brigantes in northern England, but she is a Roman ally and hands him over to Ostorius. Despite the defeat, the Silures continue to fight.", "The captured Caratacus is exhibited in chains in Claudius' triumph in Rome, but his dignified demeanour persuades the emperor to spare his life and allow his family to live free in the capital for a short period of time.", "Vonones II dies a few months after he had ascended to the throne. His son  Vologases I becomes the new Parthian king."]}, {"y": 52, "e": "AD", "t": "year", "f": ["Emperor Claudius attempts to control the Fucine Lake by digging a . km tunnel through Monte Salviano, requiring , workers and eleven years.", "Claudius completes the Aqua Claudia and Anio Novus, two aqueduct projects started by Caligula", "In Rome a law prohibits the execution of old and crippled slaves.", "Ananias, a high priest in Jerusalem, is sent to Rome after being accused of violence.", "Barea Soranus is consul suffectus in Rome."]}, {"y": 53, "e": "AD", "t": "year", "f": ["Emperor Claudius removes Herod Agrippa II from the tetrarchy of Chalcis in Greece.", "Decimus Junius Silanus Torquatus and Quintus Haterius Antoninus become Roman consuls.", "Claudius secures a senatorial decree that gives jurisdiction in financial cases to imperial procurators.  This marks a significant strengthening of imperial powers at the expense of the Senate.", "June  – Nero is adopted by Claudius as his son and marries his -year-old daughter Claudia Octavia.", "Claudius accepts Nero as his successor, to the detriment of Britannicus, his son by his first wife, Valeria Messalina."]}, {"y": 54, "e": "AD", "t": "year", "f": ["October  – Emperor Claudius dies (possibly after being poisoned by Agrippina, his wife and niece), and is succeeded by Nero.", "Nero attempts to prohibit the gladiatorial games.", "Under Nero, Rome annexes Aden to protect the maritime route between Alexandria and Asia.", "Two centurions are sent to the south of Egypt to find the source of the Nile, and possible new provinces. They report that while there are many cities in the desert, the area seems too poor to be worthy of conquest.", "Gnaeus Domitius Corbulo arrives in the East and takes up an assignment as governor of Asia, with a secret brief from Nero and his chief ministers, Seneca and Burrus, to return Armenia to the Roman Empire."]}, {"y": 55, "e": "AD", "t": "year", "f": ["Emperor Nero becomes a Roman Consul.", "The Roman jurist Sabinus writes three books on the rights of citizens.", "The apostle Paul writes his First Epistle to the Corinthians."]}, {"y": 56, "e": "AD", "t": "year", "f": ["War between Rome and Parthia breaks out due to the invasion of Armenia by King Vologases I, who has replaced the Roman-supported ruler with his brother Tiridates I of Armenia. (approximate date)", "Publius Clodius Thrasea Paetus becomes a consul in Rome.", "The Jianwu era of the Eastern Han dynasty changes to the Jianwuzhongyuan era.", "The apostle Paul writes his second Epistle to the Corinthians, probably from Philippi.", "The apostle Paul writes his Epistle to the Romans, from Corinth."]}, {"y": 57, "e": "AD", "t": "year", "f": ["Envoys from Cilicia come to Rome to accuse their late governor, Cossutianus Capito, of extortion; the Roman Senate is supported in the case by Publius Clodius Thrasea Paetus.", "Emperor Nero becomes a Roman consul again.", "In Britain, Quintus Veranius Nepos becomes governor in place of Aulus Didius Gallus. He begins a campaign against the Silures of south Wales.", "Also in Britain Venutius begins his rebellion against his wife Cartimandua.", "Emperor Guang Wu grants Nakoku (located around modern-day Fukuoka City) a golden seal, being the oldest evidence of writing in Japan. In return King Na sends an envoy to China."]}, {"y": 58, "e": "AD", "t": "year", "f": ["Emperor Nero and Marcus Valerius Messalla Corvinus become Roman consuls.", "The friendship between Nero and Marcus Salvius Otho ends when they both fall in love with Poppea Sabina, and Otho is sent to Lusitania as governor.", "Agrippina the Younger is expelled from the imperial palace by her son Nero, who installs her in Villa Antonia in Misenum, and leaving more of the effective and real power of Empire in the hands of Nero.", "Roman-Parthian War: Gnaeus Domitius Corbulo, commander in the East, launches his Armenian offensive against Parthia. He leads a Roman army (four legions) through the mountainous country of Armenia, against the fortress at Volandum, to the southwest of Artaxata. After a siege of eight hours Corbulo takes the city; the legionnaires massacre the defenders and plunder Volandum to their hearts' content.", "Corbulo marches to Artaxata crossing the Aras River; along the valley he is shadowed by tens of thousands of mounted Parthian archers led by king Tiridates I. The city opens its gates to Corbulo, just as it had to Germanicus four decades before. When he takes the -year-old Armenian capital, Corbulo gives the residents a few hours to collect their valuables and burns the city to the ground."]}, {"y": 59, "e": "AD", "t": "year", "f": ["March  – Emperor Nero orders the murder of his mother Agrippina the Younger. He tries to kill her through a planned shipwreck, but when she survives, he has her executed and frames it as a suicide.", "Gnaeus Domitius Corbulo, Roman commander in the east, captures Tigranocerta in Mesopotamia. He installs Tigranes VI, a Cappadocian prince, as ruler of Armenia. For the next four years, a cohort from Legio VI Ferrata and Legio X Fretensis is stationed in the capital as bodyguard to the king, supported by fifteen hundred auxiliaries.", "Publius Clodius Thrasea Paetus retires from the Roman Senate. He openly shows his disgust at the behaviour of Nero regarding the murder of Agrippina.", "Rioting breaks out between the people of Pompeii and the people of Nuceria during a gladiator fight in Pompeii. Thousands are killed.", "In the Satyricon, Petronius pokes fun at Roman immorality."]}, {"y": 60, "e": "AD", "t": "year", "f": ["The Roxolani are defeated on the Danube by the Romans.", "Nero's exploration of the Nile: Emperor Nero sends an expedition which reaches the historical city Meroë (Sudan). (approximate date)", "Vitellius is (possibly) proconsul of the province of Africa.", "Agrippa II of the Herodians rules the northeast of Judea.", "The city of Laodicea on the Lycus is destroyed by an earthquake"]}, {"y": 61, "e": "AD", "t": "year", "f": ["Publius Petronius Turpilianus and Lucius Caesennius Paetus become Roman consuls.", "Galba becomes governor of Hispania Tarraconensis.", "The following events in Roman Britain (Britannia) take place in  or :\nGaius Suetonius Paulinus, Roman governor of Britain, captures the island of Mona (Anglesey), the last stronghold of the Druids.\nPrasutagus, king of the Iceni (modern East Anglia), dies leaving a will which passes his kingdom to his two daughters and the Roman Empire. The Roman army however annexes the kingdom as if conquered, depriving the nobles of their hereditary lands and plundering the land. The king's widow, Boudica, is flogged and forced to watch their daughters publicly raped. Roman financiers, including Seneca the Younger, call in their loans.\nBoudica leads a rebellion of the Iceni against Roman rule in alliance with the Trinovantes, Cornovii, Durotriges and Celtic Britons. The Iceni and Trinovantes first destroy the Roman capital Camulodunum (Colchester), wipe out the infantry of the Legio IX Hispana (commanded by Quintus Petillius Cerialis) and go on to burn Londinium (London) (probably destroying London Bridge) and Verulamium (St Albans), in all cases massacring the inhabitants in their thousands.\nBattle of Watling Street: Paulinus defeats the rebels, using a flying wedge formation, and imposes wide-ranging punishments on native Britons, but is removed from office after an enquiry instituted by Gaius Julius Alpinus Classicianus (appointed procurator ) and the Romanisation of Britain continues. Boudica either poisons herself or falls sick and dies.", "Gaius Suetonius Paulinus, Roman governor of Britain, captures the island of Mona (Anglesey), the last stronghold of the Druids.", "Prasutagus, king of the Iceni (modern East Anglia), dies leaving a will which passes his kingdom to his two daughters and the Roman Empire. The Roman army however annexes the kingdom as if conquered, depriving the nobles of their hereditary lands and plundering the land. The king's widow, Boudica, is flogged and forced to watch their daughters publicly raped. Roman financiers, including Seneca the Younger, call in their loans."]}, {"y": 62, "e": "AD", "t": "year", "f": ["Emperor Nero marries for the second time, to Poppaea Sabina, ex-wife of Marcus Salvius Otho.", "After the death of Burrus and the disgrace of Seneca, Nero is free from their influence and becomes a megalomaniacal artist fascinated by Hellenism and the Orient. Tigellinus becomes Nero's counselor. His rule is highly abusive.", "Nero completes the Baths of Nero in Rome.", "A great earthquake damages cities in Campania, including Pompeii (February ).", "The Parthians invade Armenia and lay siege to Tigranocerta. The city is well-fortified and garrisoned by the Romans. The assault fails and king Vologases I retreats. Instead, he makes preparations to invade Syria."]}, {"y": 63, "e": "AD", "t": "year", "f": ["Vespasian becomes governor of Africa (estimated year).", "Gnaeus Domitius Corbulo is restored to command after the Roman debacle at the Battle of Rhandeia. He invades Armenia and defeats Tiridates I, who accepts Roman sovereignty. Parthia withdraws from the war.", "Pompeii, the city at the foot of Mount Vesuvius, builds a new monumental forum, after the town is heavily damaged by a strong earthquake.", "According to legend, Joseph of Arimathea goes to Glastonbury on the first Christian mission to Britain.", "Apostle Paul possibly visits Spain."]}, {"y": 64, "e": "AD", "t": "year", "f": ["July -  – Great Fire of Rome: A fire begins which destroyed three of fourteen of the administrative regions of Rome, more commonly known as the Palatine hill, the Circus Maximus, and the Oppian hill. Also suffering severe damage were the Campus Martius and the Via Lata.", "Persecution of Christians in Rome begins under Nero. Peter the Apostle is possibly among those crucified.", "Nero proposes a new urban planning program based on the creation of buildings decorated with ornate porticos, the widening of the streets and the use of open spaces. This plan will not be applied until after his death in .", "Lyon sends a large sum of money to Rome to aid in the reconstruction. However, during the winter of –, Lyon suffers a catastrophic fire itself, and Nero reciprocates by sending money to Lyon.", "The Kushan sack the ancient town of Taxila (in modern-day Pakistan)."]}, {"y": 65, "e": "AD", "t": "year", "f": ["April  – The freedman Milichus betrays the Pisonian conspiracy led by Gaius Calpurnius Piso to kill Emperor Nero and all the conspirators are arrested.", "An epidemic afflicts Rome.", "After a stage performance in which he appears and shocks the senatorial class considerably, Nero engages in a series of reprisals against Seneca the Younger and Tigellinus, pro-republican senators, and anyone else he distrusts.", "Nero's pregnant wife, Poppea Sabina, dies from Nero kicking her stomach or while having a miscarriage.", "Paul of Tarsus ordains Timothy as bishop of Ephesus (traditional date)."]}, {"y": 66, "e": "AD", "t": "year", "f": ["September  – Emperor Nero creates the Legio I Italica. He appoints Titus Flavius Vespasian as General of the army of Judea, and Governor of Judea which gives him command of three legions — V Macedonica, X Fretensis and XV Apollinaris.", "October – The Jewish Revolt commences against the Roman Empire. The Zealots lay siege to Jerusalem and annihilate the Roman garrison (a cohort of Legio III Cyrenaica). The Sicarii capture the fortress of Masada overlooking the Dead Sea.", "Mid–late October – Cestius Gallus, legate of Syria, marches into Judea and leads a Roman army of , men to put down the Jewish rebellion. At its core is Legio XII Fulminata, plus , selected men from the other three Syrian legions, six more cohorts of infantry and four alae of cavalry, plus over , auxiliaries furnished by Rome's eastern allies, including Herod Agrippa II and two other client kings, Antiochus IV of Commagene and Sohaemus of Emesa, who lead their forces (largely archers and cavalry) in person.", "Gallus leads his main force down the coast from Caesarea via Antipatris to Lydda, detaching other units, by land and sea, to neutralize the rebel strongholds at Joppa, Narbata and the Tower of Aphek. With Galilee and the entire Judean coast in his hands, Gallus assumes his campaign before the winter rains render the roads impassable. He turns inland and marches on Jerusalem, taking the road via the plain at Emmaus. Gallus succeeds in conquering Beit She'arim (the \"New City\") on the Bezetha Hill.", "November – Battle of Beth-Horon: Gallus abandons the siege of Jerusalem and chooses, for uncertain reasons, to withdraw west to winter quarters, where he is ambushed and defeated by Judean rebels. Some , Roman troops are killed, as well as all their pack animals, their artillery (which is to serve the Jews of Jerusalem during Titus's siege operations four years later), and the greatest disgrace of all, the eagle standard of Legio XII Fulminata. Gallus abandons his troops in disarray, fleeing to Syria."]}, {"y": 67, "e": "AD", "t": "year", "f": ["Gaius Julius Vindex revolts, first in a series of revolts that lead to Nero's downfall.", "Gaius Licinius Mucianus replaces Gaius Cestius Gallus as governor of Syria.", "First Jewish–Roman War: Vespasian arrives in Ptolemais in Phoenicia along with the Legio X Fretensis and Legio V Macedonica, to put down the revolt.", "Vespasian is joined by his son Titus, who brings Legio XV Apollinaris from Alexandria. By late spring the Roman army numbers more than , soldiers, including auxilia and troops of King Herod Agrippa II.", "Jewish leaders at Jerusalem are divided through a power struggle, and a brutal civil war erupts. The Zealots and the Sicarii execute anyone who tries to leave the city."]}, {"y": 68, "e": "AD", "t": "year", "f": ["Final year that Tacitus records Annals, a written history of the Roman Empire.", "Lucius Clodius Macer revolts against the reign of Nero.", "The Senate declares Nero as persona non grata.", "June  – Emperor Nero commits suicide four miles outside Rome. He is deserted by the Praetorian Guard, and then stabs himself in the throat.", "June  – The Roman Senate accepts Servius Sulpicius Galba, as Roman Emperor."]}, {"y": 69, "e": "AD", "t": "year", "f": ["The Year of the Four Emperors: After Nero's death, Galba, Otho, Vitellius and Vespasian succeed each other as emperor during the year. The year is marked by numerous instances of a breakdown in discipline and mutinous conduct amongst the Roman legions and the praetorian guard.", "January  – The Roman legions in Germania Superior refuse to swear loyalty to Galba. They rebel and proclaim Vitellius as emperor.", "January  – Lucius Calpurnius Piso Licinianus is adopted by Galba and appointed to deputy Roman Emperor.", "January  – Galba and his adopted son Piso are murdered by the Praetorian Guard on the Roman Forum.", "Otho seizes power in Rome, proclaims himself emperor, and reigns for three months before committing suicide."]}, {"y": 70, "e": "AD", "t": "year", "f": ["Emperor Vespasian and his son Caesar Vespasian (the future Emperor Titus) become Roman consuls.", "Panic strikes Rome as adverse winds delay grain shipments  from Africa and Egypt, producing a bread shortage. Ships laden with wheat from North Africa sail  miles to Rome's port of Ostia in  days, and the , mile voyage from Alexandria averages  days. The vessels often carry , tons each to provide the city with the , tons per week it normally consumes.", "Sextus Julius Frontinus is praetor of Rome. Legio II Adiutrix is created from marines of Classis Ravennatis.", "Pliny the Elder serves as procurator in Gallia Narbonensis.", "th of Xanthikos (14th of Nisan, about April ) – Siege of Jerusalem: Titus surrounds the Jewish capital, with three legions (V Macedonica, XII Fulminata and XV Apollinaris) on the western side and a fourth (X Fretensis) on the Mount of Olives to the east. He puts pressure on the food and water supplies of the inhabitants by allowing pilgrims to enter the city to celebrate Passover and then refusing them egress."]}, {"y": 71, "e": "AD", "t": "year", "f": ["The Romans establish a fortress at York (Eboracum), as a base for their northern forces. Initially established solely for Legio IX Hispana, it expands later to include public housing, baths and temples.", "Battle of Stanwick: Quintus Petillius Cerialis, governor of Britain, puts down a revolt by the Brigantes.", "Emperors Vespasian and Marcus Cocceius Nerva are Roman Consuls.", "Battle of Treves: Cerialis defeats Claudius Civilis, thus quelling the Batavian rebellion.", "Titus is awarded with a triumph, accompanied by Vespasian and his brother Titus Flavius Domitian. In the parade are Jewish prisoners and treasures of the Temple of Jerusalem, including the Menorah and the Pentateuch. The leader of the Zealots, Simon Bar Giora, is lashed and strangled in the Forum."]}, {"y": 72, "e": "AD", "t": "year", "f": ["Antiochus IV of Syria is deposed by Emperor Vespasian.", "Vespasian and Titus are Roman Consuls.", "First Jewish–Roman War: The Roman army (Legio X Fretensis) under Sextus Lucilius Bassus lays siege to the Jewish garrison of Machaerus at the Dead Sea. After they capitulate, the Zealots are allowed to leave the fortress before it is destroyed.", "The Romans lay siege to Masada, a desert fortress held by the Sicarii.", "Flavia Neapolis (Nablus) is founded."]}, {"y": 73, "e": "AD", "t": "year", "f": ["Vespasian and Titus are appointed to be Roman censors.", "Spring – The Roman governor Lucius Flavius Silva lays siege to Masada, the last outpost of the Jewish rebels following the end, in , of the First Jewish-Roman War (Jewish Revolt). The Roman army (Legio X Fretensis) surrounds the mountain fortress with a -mile long siege wall (circumvallation) and builds a rampart of stones and beaten earth against the western approach. After the citadel is conquered,  Zealots under the leadership of Eleazar ben Ya'ir commit mass suicide when defeat becomes imminent.", "Pliny the Elder serves as procurator in Hispania Tarraconensis.", "Titus Flavius Domitianus becomes Roman Consul.", "Emperor Vespasian begins conquest of territory east of the upper Rhine and south of the Main. In addition, he reorganizes the defenses of the upper and lower Danube."]}, {"y": 74, "e": "AD", "t": "year", "f": ["Emperor Vespasian and his son Titus Caesar Vespasianus become Roman Consuls.", "The Black Forest region is reattached to the Roman Empire.", "December  – Vespasian grants generous privileges to doctors and teachers.", "Emperor Ming of Han appoints Chen Mu to the revived office of Protector of the Western Regions.", "Chinese generals Dou Gu (Teou Kou) and Geng Bing (Keng Ping) take control of Turpan."]}, {"y": 75, "e": "AD", "t": "year", "f": ["Emperor Vespasian and his son Titus Caesar Vespasianus become Roman Consuls.", "The Temple of Peace, also known as the Forum of Vespasian, is built in Rome. The temple celebrates the conquest of Jerusalem (in ) and houses the Menorah from Herod's Temple.", "Vespasian fortifies Armazi (Georgia) for the Iberian king Mithridates I. The Alans raid the Roman frontier in Armenia.", "Sextus Julius Frontinus becomes governor of Britannia and makes his headquarters in Isca Augusta (Wales).", "Frontinus begins his conquest of Wales; Legio II Augusta is moved to the border of the River Usk."]}, {"y": 76, "e": "AD", "t": "year", "f": ["Emperors Vespasianus Augustus and Titus Caesar Vespasianus become Roman Consuls.", "Governor Sextus Julius Frontinus subdues the Silures and other hostile tribes of Wales, establishing a fortress at Caerleon or Isca Augusta for Legio II Augusta, and makes a network of smaller forts for his auxiliary forces.", "First year of Jianchu era of the Chinese Han dynasty.", "Chinese historian Ban Gu develops a theory of the origins of the universe.", "Pope Anacletus I succeeds Pope Linus as the third pope of the Catholic Church (according to the official Vatican list)."]}, {"y": 77, "e": "AD", "t": "year", "f": ["Gnaeus Julius Agricola is named governor of Britannia, a post he occupies until . He extends the Roman influence to the mouth of the River Clyde (Scotland), and builds fortifications.", "Agricola subdues the Ordovices in Wales, and pursues the remnants of the tribe to Anglesey, the holy island of the Druids.", "The Caledonian tribes in Scotland form a confederacy of , warriors, under the leadership of Calgacus.", "Winter – Agricola conquers Anglesey, and disperses his army to their winter quarters.", "King Giru of Baekje succeeds to the throne of Baekje in the Korean Peninsula."]}, {"y": 78, "e": "AD", "t": "year", "f": ["The Romans conquer the Ordovices, located in present-day northern Wales, as well as the Silures.", "Gnaeus Julius Agricola replaces Sextus Julius Frontinus as governor of Roman Britain, which leads to the conquering of portions of Wales and northern England.", "Indian Prince Aji Caka introduces the Sanskrit language and Pallawa script, used to inscribe Javanese words and phrases, to the Indonesian islands.", "Emperor Kadphises of the Kushan Empire sends a delegation to Rome, to seek support against the Parthians.", "This is the base year (year zero) of the Saka era used by some Hindu calendars, the Indian national calendar, and the Cambodian Buddhist calendar. It begins near the vernal equinox for the civil solar calendar, but begins opposite the star Spica for the traditional solar calendar."]}, {"y": 79, "e": "AD", "t": "year", "f": ["Vespasianus Augustus and Titus Caesar Vespasianus become Roman Consuls.", "June  – Emperor Vespasian dies of fever from diarrhea; his last words on his deathbed are: \"I think I'm turning into a god.\" Titus succeeds his father as Roman emperor. Titus' Jewish mistress, Berenice, comes to join him in Rome, but he exiles her to please the Senate.", "August  or c. October  – Eruption of Mount Vesuvius: Mount Vesuvius erupts, destroying Pompeii, Herculaneum, Stabiae and Oplontis. The Roman navy (based at Misenum), commanded by Pliny the Elder, evacuates refugees. Pliny dies after inhaling volcanic fumes.", "Roman conquest of Britain: Gnaeus Julius Agricola campaigns in Britain:\nChester is founded as a castrum or Roman fort with the name Deva Victrix. The fortress is built by Legio II Adiutrix and contains barracks, granaries, military baths and headquarters.\nMamucium (the first Manchester) is founded as a frontier fort and settlement in the North West of England, a distance to the north of Chester.\nAgricola enters Caledonia (modern-day Scotland) but is resisted by the natives.", "Chester is founded as a castrum or Roman fort with the name Deva Victrix. The fortress is built by Legio II Adiutrix and contains barracks, granaries, military baths and headquarters."]}, {"y": 80, "e": "AD", "t": "year", "f": ["An epidemic afflicts Rome.", "Martial publishes the Liber Spectaculorum.", "King Pasa becomes ruler of the Korean kingdom of Silla."]}, {"y": 81, "e": "AD", "t": "year", "f": ["September  – Domitian succeeds his brother Titus as emperor. Domitian is not a soldier like his two predecessors, and his administration is directed towards the reinforcement of a monarchy.  By taking the title of Dominus (\"lord\"), he scandalizes the senatorial aristocracy. Romanisation progresses in the provinces, and life in the cities is greatly improved.  Many provincials – Spanish, Gallic, and African – become Senators.", "The Arch of Titus is constructed.", "Pliny the Younger is flamen Divi Augusti (priest in the cult of the Emperor).", "The silver content of the Roman denarius rises to % under emperor Domitian, up from % in the reign of Vitellius.", "Possible date of the First Epistle of Peter."]}, {"y": 82, "e": "AD", "t": "year", "f": ["Emperor Domitian becomes Roman Consul.", "Gnaeus Julius Agricola raises a fleet, and encircles the Celtic tribes beyond the Forth; the Caledonians rise in great numbers against the Romans. They attack the camp of Legio IX Hispana at night, but Agricola sends his cavalry in, and puts them to flight.", "Calgacus unites the Picts (, men) in Scotland, and is made chieftain of the Caledonian Confederacy.", "Dio Chrysostom is banished from Rome, Italy, and Bithynia, after advising one of the Emperor's conspiring relatives.", "Domitian levies Legio I Minervia."]}, {"y": 83, "e": "AD", "t": "year", "f": ["Possible date of the Battle of Mons Graupius ( or ):  According to Tacitus, , Britons and  Romans are killed.", "Emperor Domitian fights the Chatti, a Germanic tribe.  His victory allows the construction of fortifications (Limes) along the Rhine-frontier.", "The Roman fort Inchtuthil is built in Scotland.", "Domitian is, again, also a Roman Consul.", "Possible date that Demetrius of Tarsus visits an island in the Hebrides populated by holy men, possibly druids."]}, {"y": 84, "e": "AD", "t": "year", "f": ["Possible date of the Battle of Mons Graupius ( or ), in which Gnaeus Julius Agricola defeats the Caledonians.", "Emperor Domitian recalls Agricola back to Rome, where he is rewarded with a triumph and the governorship of the Roman province of Africa, but he declines it.", "Pliny the Younger is sevir equitum Romanorum (commander of a cavalry squadron).", "The construction of the limes, a line of Roman fortifications from the Rhine to the Danube, has begun.", "Through his election as consul for ten years and censor for life, Domitian openly subordinates the republican aspect of the state to the monarchical."]}, {"y": 85, "e": "AD", "t": "year", "f": ["Emperor Domitian repulses a Dacian invasion of Moesia.", "Dacians under Decebalus engage in two wars against the Romans from this year to  or .", "Domitian appoints himself censor for life, which gives him the right to control the Senate.  His totalitarian tendencies put the senatorial aristocracy firmly in opposition to him.", "Baekje invades the outskirts of Silla in the Korean peninsula. The war continues until the peace treaty of ."]}, {"y": 86, "e": "AD", "t": "year", "f": ["Emperor Domitian introduces the Capitoline Games.", "Roman general (and future emperor) Trajan begins a campaign to crush an uprising in Germania.", "Germania is divided into two provinces, Germania Inferior and Germania Superior (approximate date).", "Martial publishes Books I and II of the Epigrams.", "First Battle of Tapae: Roman legions face disaster in Dacia, when Roman general Cornelius Fuscus launches a powerful offensive that becomes a failure. Encircled in the valley of Timi, he dies along with his entire army. Rome must pay tribute to the Dacians in exchange for a vague recognition of Rome's importance."]}, {"y": 87, "e": "AD", "t": "year", "f": ["The Roman Julius Maternus  explores western Africa (approximate date).", "Lyon, a city in Gaul, has a population of over , citizens (approximate date).", "Sextus Julius Sparsus gains power in the Roman Senate (approximate date).", "Decebalus becomes king of Dacia."]}, {"y": 88, "e": "AD", "t": "year", "f": ["Two Egyptian obelisks are erected in Benevento in front of the Temple of Isis, in honour of Emperor Domitian.", "Quintilian retires from teaching and from pleading, to compose his great work on the training of the orator (Institutio Oratoria).", "The First Dacian War ends: Decebalus becomes a client king of Rome, he receives money, craftsmen and war machines to protect the borders (limes) of the Roman Empire.", "Emperor Han Zhangdi dies at age  after a -year reign in which Chinese military forces have become powerful enough to march against tribes who threaten their northern and western borders. Having used intrigue as well as armed might to achieve his ends, Zhangdi and his General Ban Chao have reestablished Chinese influence in Inner Asia, but court eunuchs have increased their power during the emperor's reign. Zhangdi is succeeded by his -year-old son Zhao, who will reign until  as emperor Han Hedi, but he will be a virtual pawn of Empress Dou (adoptive mother) and scheming courtiers who will effectively rule the Chinese Empire.", "Last year (4th) of yuanhe era and start of zhanghe era of the Chinese Eastern Han dynasty."]}, {"y": 89, "e": "AD", "t": "year", "f": ["January  – Lucius Antonius Saturninus incites a revolt against Emperor Domitian (it is suppressed by January ).", "Legio XIII Gemina is transferred to Dacia, to help in the war against King Decebalus.", "Aquincum (old Budapest, Óbuda) is founded (approximate date).", "First year of Yongyuan era of the Chinese Han dynasty.", "June – Battle of Ikh Bayan: The Han Chinese army under Dou Xian, allied with the southern Xiongnu, is victorious over the Northern Xiongnu."]}, {"y": 91, "e": "AD", "t": "year", "f": ["Manius Acilius Glabrio and Marcus Ulpius Traianus become Roman Consuls.", "Pliny the Younger is named a tribunus plebis.", "Ban Chao is made protector-general of the Western Regions.", "Rome is described by Statius in his poems."]}, {"y": 92, "e": "AD", "t": "year", "f": ["Emperor Domitian becomes a Roman Consul.", "In spring, several tribes (probably Marcomanni, Quadi, Jazyges) cross the Danube and attack Pannonia, probably destroying Legio XXI Rapax. These tribes are defeated from May to December , and chased back over the river. The Romans do not pursue the retreating tribes.", "The Roman army moves into Mesopotamia (modern Syria).", "The Flavian Palace is completed on the Palatine."]}, {"y": 93, "e": "AD", "t": "year", "f": ["Emperor Domitian persecutes the Christians.", "Pliny the Younger is named a praetor.", "The Xianbei incorporates , Xiongnu, and establishes the Xianbei State in Mongolia (approximate date).", "Josephus completes his Jewish Antiquities (or in )."]}, {"y": 94, "e": "AD", "t": "year", "f": ["Emperor Domitian rebuilds and rededicates the Curia Julia (meeting place of the Roman Senate), which had burned down in .", "Domitian banishes all Stoic philosophers from Rome.", "The Chinese General Ban Chao completes his conquest of the Tarim Basin by taking Yānqi, which is located on the strategic Silk Road.", "The Roman poet Publius Papinius Statius retires to Naples from Rome (approximate date)."]}, {"y": 95, "e": "AD", "t": "year", "f": ["Emperor Domitian and Titus Flavius Clemens become Roman Consuls.", "Domitian executes senators out of paranoiac fears that they are plotting to kill him.", "The Roman consul Manius Acilius Glabrio is ordered by Domitian to descend into the arena of the Colosseum to fight a lion. After he kills the animal, Domitian banishes and puts him to death.", "In Rome a severe form of malaria appears in the farm districts and will continue for the next  years, taking out of cultivation the fertile land of the Campagna, whose market gardens supply the city with fresh products. The fever drives small groups of farmers into the crowded city, bringing the malaria with them, and lowers Rome's live-birth rate while rates elsewhere in the empire are rising.", "The Book of Revelation is written (approximate date)."]}, {"y": 96, "e": "AD", "t": "year", "f": ["September  – Emperor Domitian is stabbed to death by a freedman at the age  after a -year reign, in a palace conspiracy involving officers of the Praetorian Guard. The Flavian Dynasty ends.", "Nerva is declared emperor by the Roman Senate as the new ruler of the Roman Empire. He recalls citizens exiled by Domitian; this is the beginning of the Era of the Five Good Emperors. The Antonines Dynasty starts.", "Marcus Ulpius Traianus becomes governor of Upper Germany.", "The Arch of Titus is completed in Rome.", "End of the period covered by Tacitus in his Histories."]}, {"y": 97, "e": "AD", "t": "year", "f": ["October  – Emperor Nerva recalls his general Marcus Ulpius Trajanus, age , from the German frontier and is forced by the Praetorian Guard to adopt him as his successor.", "Tacitus advances to consulship.", "The Roman colony of Cuicul is started in Numidia.", "Gloucester, England is founded as Colonia Glevum Nervensis by the Romans.", "Nerva recognizes the Sanhedrin of Jamnia as an official governmental body of the Jews, and the patriarch or nasi is designated as the representative of the Jewish people in Rome."]}, {"y": 98, "e": "AD", "t": "year", "f": ["January  – Emperor Nerva suffers a stroke during a private audience.", "January  – Nerva dies of a fever at his villa in the Gardens of Sallust and is succeeded by his adopted son Trajan. Trajan is the first Roman Emperor born in Italica, near Seville. A brilliant soldier and administrator, he enters Rome without ceremony and wins over the public. Continuing the policies of Augustus, Vespasian and Nerva, he restores the Senate to its full status in the government and begins a form of state welfare aimed at assuring that poor children are fed and taken care of. He has a specific vision of the Empire, which reaches its maximum extent under his rule, and keeps a close watch on finances. Taxes, without any increase, are sufficient during his reign to pay the considerable costs of the budget. The informers used by Domitian to support his tyranny are expelled from Rome. In order to maintain the Port of Alexandria, Trajan reopens the canal between the Nile and the Red Sea.", "Trajan elevates Ladenburg to city status (civitas).", "Tacitus finishes his Germania (approximate date).", "The silver content of the Roman denarius rises to  percent under emperor Trajan, up from  percent under Domitian."]}, {"y": 99, "e": "AD", "t": "year", "f": ["Emperor Trajan returns to Rome.", "Emissaries of the Kushan Empire reach the Roman Empire.", "August  – Papyrus Oxyrhynchus , recording the sale of a slave girl, is written.", "November  – Pope Evaristus succeeds Pope Clement I as the fifth pope according to Roman Catholic tradition."]}, {"y": 100, "e": "AD", "t": "year", "f": ["Emperor Trajan and Frontinus become Roman consuls.", "Bricks become the primary building material in the Roman Empire.", "Pliny the Younger advances to consulship, giving his panegyric on Trajan in the process.", "The Imperial Roman army reaches , soldiers.", "Titus Avidius Quietus' rule as governor of Roman Britain ends."]}, {"y": 101, "e": "AD", "t": "year", "f": ["Trajan begins his fourth consulship.", "Emperor Trajan starts an expedition against Dacia, exceeding the limits of the Roman Empire set by Augustus.", "Third Battle of Tapae: Roman forces, led by Trajan, defeat the Dacian king Decebalus in Transylvania.", "Epictetus writes and publishes The Discourses of Epictetus (approximate date)."]}, {"y": 102, "e": "AD", "t": "year", "f": ["Lucius Julius Ursus Servianus and Lucius Licinius Sura become Roman consuls.", "Emperor Trajan returns to Rome after a successful campaign against Dacia, through which he reestablishes clear Roman sovereignty over King Decebalus.", "Trajan divides Pannonia into two provinces, sometime between this year and .", "The port of Portus is enlarged.", "Planning and surveying for the port of Ostia is undertaken."]}, {"y": 103, "e": "AD", "t": "year", "f": ["Emperor Trajan and Manius Laberius Maximus become Roman consuls.", "Pliny the Younger becomes a member of the college of Augurs (–).", "Legio X Gemina moves to Vienna, where it remains until the .", "In Palmyra, Syria, a Temple of the Sun is erected to the god Baal."]}, {"y": 104, "e": "AD", "t": "year", "f": ["Pliny the Younger continues as a member of the College of Augurs (–).", "Nijmegen is renamed Ulpia Noviomagus Batavorum.", "A fire breaks out in Rome.", "Trajan gives the order to have the Alcántara Bridge, constructed by the architect Lacer, built over the Tagus River at Alcántara (Hispania).", "Apollodorus of Damascus builds a stone bridge over the Danube more than , meters (, feet) long, almost  meters ( feet) high and  meters ( feet) wide. The bridge connects what is now Serbia with Romania (at the time known as Dacia)."]}, {"y": 105, "e": "AD", "t": "year", "f": ["Emperor Trajan starts the second expedition against Dacia; he leaves with the Imperial Roman fleet from Brundusium.", "Permanent castrum of Legio II Adiutrix at Aquincum (modern Budapest) in Pannonia.", "Legio XXX Ulpia Victrix and II Traiana Fortis are created by Trajan.", "The Romans conquer Kerak from the Nabateans.", "Pacorus II of Parthia dies after a -year reign, in which he has reclaimed all of his empire. His successor Vologases III reigns until , suppressing brief rebellions, as he battles against the Kushan and Alani."]}, {"y": 106, "e": "AD", "t": "year", "f": ["Ignatius writes a letter to Christians in Smyrna, using the term Catholic Church (approximate date). This is the earliest surviving witness to the use of the term \"Catholic Church\".", "Emperor Trajan conquers the Dacian Fortresses of the Orăştie Mountains, and surrounds the capital, Sarmizegetusa.", "Battle of Sarmizegetusa: The Dacians are defeated with , captured. King Decebalus flees and commits suicide.", "August  – The south-eastern part of Dacia (modern Romania) becomes a Roman province: Roman Dacia. The veterans of the legions are given land in the new province for their service in the Roman army.", "Trajan annexes the Nabataean Kingdom (with its capital Petra) as the Roman province of Arabia Petraea. The epoch of the calendar of the province of Arabia begins on March ."]}, {"y": 107, "e": "AD", "t": "year", "f": ["Lucius Licinius Sura and Quintus Sosius Senecio become consuls of Rome.", "An Indian ambassador is received by Emperor Trajan.", "First year of the yongchu era of the Chinese Eastern Han Dynasty.", "Han Andi (An-ti) becomes emperor of China."]}, {"y": 108, "e": "AD", "t": "year", "f": ["Appius Annius Trebonius Gallus and Marcus Atilius Bradua become Roman Consuls.", "Tacitus writes Histories, which covers the period from  to .", "The Hypogeum of Yarhai, an underground tomb from the Syrian city of Palmyra dedicated to the family of Yarhai, is built."]}, {"y": 109, "e": "AD", "t": "year", "f": ["June  – The Aqua Traiana is inaugurated by Emperor Trajan; the aqueduct channels water from Lake Bracciano,  kilometers ( mi) northwest of Rome.", "The Via Traiana is constructed at the Emperor Trajan's personal expense; the road connects Benevento with Brundisium (Brindisi).", "The Baths of Trajan, built by the architect Apollodorus of Damascus, are dedicated during the Calends. The thermae are constructed on the platform of the Palace of Nero (Domus Aurea) in Rome.", "Pliny the Younger is legate to Bithynia.", "Osroes I of Parthia succeeds his brother Pacorus II, and rules over the western Parthian Empire."]}, {"y": 110, "e": "AD", "t": "year", "f": ["The Forum of Trajan is constructed in Rome, by the Syrian architect Apollodorus of Damascus.", "The Roman Empire has more than , kilometers (, mi) of roads.", "Caravans make regular departures from Luoyang with Chinese ginger, cassia (a type of cinnamon), and silk to be bartered in Central Asia for gold, silver, glassware, pottery, cloth, and intaglio gems from Rome.", "Suetonius, Roman historian, publishes Viris Illustribus (\"On Famous Men\" – in the field of literature)."]}, {"y": 112, "e": "AD", "t": "year", "f": ["Emperor Trajan and Titus Sextius Cornelius Africanus become Roman consuls.", "August  – Salonia Matidia receives the title of Augusta upon the death of Marciana.", "Hadrian succeeds Gaius Julius Cassius Steirieus as archon of Athens.", "Tacitus is named proconsul of the Roman province of Asia (–).", "King Jima succeeds Pasa as ruler of the Korean kingdom of Silla."]}, {"y": 113, "e": "AD", "t": "year", "f": ["Trajan's Column near the Colosseum in Rome is completed to commemorate the Emperor's victory over the Dacians in the Second Dacian War.", "Osroes I of Parthia violates the treaty with Rome by installing a puppet ruler in Armenia. Emperor Trajan marches east, without first attempting to use diplomacy to resolve the disagreement.", "Emperor Trajan sails from Rome to begin his expedition against Parthia. He arrives in Athens where Parthian envoys greet him with olive branches, a sign of peace.", "Basilica Ulpia is dedicated.", "Last (7th) year of Yongchu era of the Chinese Eastern Han Dynasty."]}, {"y": 114, "e": "AD", "t": "year", "f": ["Construction begins on the Arch of Trajan in Benevento.", "The kingdom of Osroene becomes a vassal kingdom of the Roman Empire.", "Emperor Trajan defeats the Parthians and overruns Armenia and northern Mesopotamia.", "A monument to Philopappos, prince-in-exile of old Commagene (a buffer-state between Rome and Parthia) is erected in Athens.", "First year of Yuanchu era of the Chinese Eastern Han dynasty."]}, {"y": 115, "e": "AD", "t": "year", "f": ["Emperor Trajan is cut off in southern Mesopotamia after his invasion of that region.", "Trajan captures the Parthian capital of Ctesiphon.", "The Diaspora Revolt erupts almost simultaneously across various Jewish Diaspora communities in the empire's east, including Egypt, Libya and Cyprus.", "Alexandria in Egypt is damaged during the Jewish-Greek civil wars. Marcus Rutilius Lupus, the Roman governor, sends Legio XXII Deiotariana to protect the inhabitants of Memphis.", "A revolt breaks out in Britain; the garrison at Eboracum (York) is massacred."]}, {"y": 116, "e": "AD", "t": "year", "f": ["Emperor Trajan completes his invasion of Parthia by capturing the cities of Seleucia, Babylon, Ctesiphon and Susa, marking the high-water mark of the Roman Empire's eastern expansion.", "Trajan makes Syria a province of Rome and crosses the Tigris to annex Adiabene. He proceeds with his army to the Persian Gulf and conquers territory that becomes the province of Parthia.", "Trajan removes Osroes I as king of Parthia, and appoints his son Parthamaspates in his place. Parthamaspates romanizes his name to Parthicus.", "Trajan sends two expeditionary forces. One, consisting of elements of Legio III Cyrenaica, to suppress the revolt in Judea and the other Legio VII Claudia to restore order on Cyprus.", "In summer, rebellious movement emerges in Mesopotamia against Roman occupation. General Lusius Quietus is sent by Trajan to suppress the uprisings, recovering Nisibis, besieging and sacking Edessa, and waging war against local Jews"]}, {"y": 117, "e": "AD", "t": "year", "f": ["Trajan falls seriously ill, leaving Hadrian in command of the east. On his death bed, Trajan allegedly adopts Hadrian and designates him as his successor.", "August  -  – Emperor Trajan dies of a stroke at Selinus in Cilicia, age , while en route from Mesopotamia to Italy, leaving the Roman Empire at its maximal territorial extent.", "Hadrian, who will reign until , succeeds him.\nHadrian, a Spaniard like Trajan, as Emperor inaugurates a policy of retrenchment and cultural integration, giving up the policy of conquest of his predecessor in order to consolidate the empire.", "Hadrian, a Spaniard like Trajan, as Emperor inaugurates a policy of retrenchment and cultural integration, giving up the policy of conquest of his predecessor in order to consolidate the empire.", "The Jewish Diaspora Revolt is quelled, likely by autumn , though unrest may have persisted in Egypt until early . Its suppression results in the near-complete expulsion of Jews from Cyrenaica, Cyprus, and several regions of Egypt."]}, {"y": 118, "e": "AD", "t": "year", "f": ["Trajan's Forum (commissioned by the late Emperor Trajan) is completed with triumphal arches, columns, a market complex, and an enormous basilica, all of which replace hundreds of dwellings.", "Emperor Hadrian is also a Roman Consul.", "Rome has a population exceeding  million, making it the largest city in the world.", "Osroene is returned to native rule by the Roman Empire.", "Plot of the consuls:  Hadrian executes four senators, all former consuls, who had been shown to have plotted against him.  His relations with the Senate are strained."]}, {"y": 119, "e": "AD", "t": "year", "f": ["Emperor Hadrian stations Legio VI Victrix in Roman Britain, to assist in quelling the resistance of a local rebellion. The legion is key in securing the victory, and eventually replaces Legio IX Hispana at Eboracum.", "Hadrian also visits Britain in this year at the request of governor of Britain Quintus Pompeius Falco.", "Salonia Matidia (a niece of former Emperor Trajan) dies. Hadrian delivers her funeral oration, and grants her a temple in Rome.", "Reign in Northern India by Nahapana, Scythian king. He attacks the kingdom of Andhra and annexes Southern Rajputana."]}, {"y": 120, "e": "AD", "t": "year", "f": ["Emperor Hadrian visits Britain.", "Foss Dyke is constructed in Britain.", "A Kushan ambassadorial contingent visits with Hadrian.", "Suetonius becomes Hadrian's secretary ab epistolis.", "Approximate date\nLegio IX Hispana last known to be in existence.\nThe Market Gate of Miletus is built at Miletos (moved in modern times to Staatliche Museen zu Berlin, Preußischer Kulturbesitz, Antikensammlung)."]}, {"y": 121, "e": "AD", "t": "year", "f": ["Roman settlement in present-day Wiesbaden, Germany, is first mentioned.", "Emperor Hadrian fixes the border between Roman Britain and Caledonia, on a line running from the River Tyne to the Solway Firth.", "Construction of the Temple of Venus and Roma begins in Rome.", "Era name changes from Yongning (2nd year) to Jianguang in the Chinese Eastern Han dynasty."]}, {"y": 122, "e": "AD", "t": "year", "f": ["Emperor Hadrian orders that a -mile (-kilometer) wall be built to mark the northern Roman Empire while personally visiting the area. Hadrian's Wall, as it comes to be known, is intended to keep the Caledonians, Picts and other tribes at bay.", "Vindolanda, a Roman auxiliary fort (castrum) in northern England, is garrisoned by cohort VIII Batavorum.", "September  – The building of Hadrian's Wall begins.", "Hadrian gives up the territories conquered in Scotland.", "Change of era name from Jianguang (2nd year) to Yanguang of the Chinese Eastern Han dynasty."]}, {"y": 123, "e": "AD", "t": "year", "f": ["Emperor Hadrian averts a war with Parthia by a personal meeting with Osroes I (according to the Historia Augusta, disputed).", "Housesteads Fort is constructed on Hadrian's Wall north of Bardon Mill.", "Hadrian's Villa at Tivoli is built.", "The Temple of Al-Lat in Palmyra is dedicated somewhere between this year and .", "In China, Ban Yong, son of Ban Chao, reestablishes the Chinese control over the Tarim Basin."]}, {"y": 124, "e": "AD", "t": "year", "f": ["January  – Gaius Bellicius Torquatus and  Manius Acilius Glabrio begin the year as the new consuls, but the two are replaced in April.", "May – Aulus Larcius Macedo, the former Governor of Galatia; and Publius Ducenius Verres take office for four month as the suffect consuls to succeed Bellicius and Glabrio, and serve until the end of August.", "September – Gaius Valerius Severus and Gaius Julius Gallus replace consuls Larcius and Ducenius and serve until the end of the year.", "Emperor Hadrian begins to rebuild the Olympeion in Athens.", "Antinous becomes Hadrian's beloved companion on his journeys through the Roman Empire."]}, {"y": 125, "e": "AD", "t": "year", "f": ["The Pantheon is constructed (in Athens) as it stands today, by Ictinus.", "Hadrian's Villa, Tivoli, Italy, starts to be built (approximate date).", "Plague sweeps North Africa in the wake of a locust invasion that destroys large areas of cropland. The plague kills as many as , in Numidia and possibly , on the coast before moving to Italy, where it takes so many lives that villages and towns are abandoned. (or was it around )", "Last (4th) year of the Yanguang era of the Chinese Han dynasty.", "Change of emperor of the Chinese Han dynasty from Han Andi to Marquis of Beixiang, then to Han Shundi."]}, {"y": 127, "e": "AD", "t": "year", "f": ["Emperor Hadrian returns to Rome, after a seven-year voyage to the Roman provinces.", "Hadrian, acting on the advice of his proconsul of Asia, Gaius Minicius Fundanus, determines that Christians shall not be put to death without a trial.", "Kanishka I starts to rule in the Kushan Empire (approximate date).", "The philosopher Carpocrates rejects ownership of private property as being un-Christian."]}, {"y": 128, "e": "AD", "t": "year", "f": ["Emperor Hadrian visits the Roman province of North Africa, in order to inspect Legio III Augusta stationed at Lambaesis. For strategic reasons, the legionnaires are located in the Aurès Mountains.", "Hadrian's Wall is completed in Britain. Built mostly of stone in the east and with a wooden  palisade in the west. They construct at least  forts, with about , legionaries digging ditches, quarrying rock and cutting stone, preventing idleness which led to unrest and rebellions in the ranks.", "Roman agriculture declines, as imports from Egypt and North Africa depress wheat prices, making it unprofitable to farm, and forcing many farmers off the land.", "Roman bakeries produce dozens of bread varieties, and the Romans distribute free bread for the poor.", "Hadrian begins his inspection of the provinces of Greece, Asia Minor and Egypt."]}, {"y": 129, "e": "AD", "t": "year", "f": ["A defense for Numidia is constructed at Lambaesis by Legio III Augusta.", "Emperor Hadrian continues his voyages, now inspecting Caria, Cappadocia and Syria.", "The song \"Angel's Hymn\" is made.", "Change of Patriarch of Constantinople, from Patriarch Diogenes to Eleutherius."]}, {"y": 130, "e": "AD", "t": "year", "f": ["A law is passed in Rome banning the execution of slaves without a trial.", "The Temple of Olympian Zeus is completed at Athens.", "Emperor Hadrian visits the cities Petra and Gerasa (Jerash).", "A Triumphal Arch for Hadrian is built in Gerasa.", "Construction begins on Canopus, Hadrian's Villa, Tivoli, Italy."]}, {"y": 131, "e": "AD", "t": "year", "f": ["Emperor Hadrian builds the city Aelia Capitolina, on the location of Jerusalem.", "The Praetor's Edict is definitively codified by Salvius Julianus, on Hadrian's orders.  This change means that senatorial decrees become a mere confirmation of the imperial speech (oratio principis) which initiated them.", "Reorganization of the Imperial Council: Central administration is reinforced, and administrative positions are entrusted to knights, according to a very strict hierarchy. Under the reorganization, the Roman Senate is excluded from controlling the business of state.", "Hadrian restores the monarchist policy of Claudius and Domitian.  The equestrian order is given full legal status, and attains the second order of the state.", "Italy is divided into legal districts managed by consuls, a direct blow to the power and prestige of the Senate."]}, {"y": 132, "e": "AD", "t": "year", "f": ["The Temple of Olympian Zeus (Athens) is completed, using Cossutius' design.", "Bar Kokhba revolt: The messianic, charismatic Jewish leader Simon bar Kokhba starts a war of liberation for Judea against the Romans, which is eventually crushed (in ) by Emperor Hadrian; Rabbi Akiva is supportive of the rebellion.", "Legio X Fretensis must evacuate Jerusalem, returning to Caesarea. The Jews enter the city, and re-establish their system of sacrifices. They strike coins to celebrate their independence, which will last for only  months. Legio XXII Deiotariana, which advanced from Egypt, is completely destroyed.", "Merchants in Britain build structures outside the forts of Hadrian's Wall, and offer goods and services (including brothels) to Roman soldiers, who receive salaries in a region that otherwise has virtually no ready money.", "Construction begins on the Mausoleum of Hadrian in Rome (known today as Castel Sant'Angelo)."]}, {"y": 134, "e": "AD", "t": "year", "f": ["A law improving the lot of free workers is passed in Rome.", "Arrianus, Roman governor of Cappadocia, repulses an attack of the Alani, a nomadic tribe from southeastern Russia.", "Summer – Sextus Julius Severus, Roman governor of Judea, begins a campaign against the Jewish rebel strongholds in the mountains.", "The Romans retake Jerusalem. The largely-destroyed city is renamed Aelia Capitolina.", "Ilseong becomes ruler of the Korean kingdom of Silla."]}, {"y": 135, "e": "AD", "t": "year", "f": ["A Jewish diaspora begins, as Emperor Hadrian bars Jews from Jerusalem, and has survivors of the massacre dispersed across the Roman Empire. Many join Mediterranean ports.", "Jerusalem is renamed Colonia Aelia Capitolina, in honor of Hadrian. Legio VI Ferrata rebuilds the legionary fortress in the city, and constructs a Roman temple at Golgotha.", "An altar to Jupiter is erected, on the site of the Temple in Jerusalem.", "Canopus, Hadrian's Villa, Tivoli, Italy, is finished.", "Alans threaten Cappadocia; they are repulsed by Arrian."]}, {"y": 136, "e": "AD", "t": "year", "f": ["The war against the Suebi begins.", "Emperor Hadrian chases the Jews from Galilee, and receives a triumphal arch near Scythopolis.", "The Roman province of Iudaea (plus Galilee) becomes Syria Palaestina; the name Palestine as a designation for this land has been used since at least the  BC (mentioned by Herodotus).", "Hadrian dictates his memoirs at his villa near Tivoli (Tibur) outside Rome.", "Hadrian uncovers a new conspiracy among certain senators. He adopts Lucius Aelius as his heir."]}, {"y": 138, "e": "AD", "t": "year", "f": ["February  – Emperor Hadrian makes Antoninus Pius his successor, on condition that he adopt Marcus Aurelius and Lucius Verus.", "July  – Hadrian dies after a heart failure at Baiae, and is buried at Rome in the Gardens of Domitia beside his wife, Vibia Sabina.", "Antoninus Pius succeeds Hadrian as Roman Emperor, and asks the Senate to confer divine honors for Hadrian.", "Construction begins on the Theater of Philadelphia (Amman).", "Hadrian's Villa, Tivoli, Italy, is finished."]}, {"y": 139, "e": "AD", "t": "year", "f": ["The Tomb of Hadrian in Rome is completed; Emperor Antoninus Pius cremates the body of Hadrian, and places his ashes, together with that of his wife Vibia Sabina and his adopted son, Lucius Aelius, in the mausoleum.", "Marcus Aurelius is named Caesar. He marries the -year-old Faustina the Younger, daughter of Antoninus Pius.", "Antoninus Pius and Gaius Bruttius Praesens become Roman Consuls.", "Mcurn earthquake, listed in bibliographical records of seismology as having affected the city of Mcurn (modern Hösnek, Turkey). The earthquake reportedly took place in the vicinity of Mount Ararat. The region was part of the historic Kingdom of Armenia, corresponding to eastern areas of modern Turkey. A primary source for the earthquake is the work of the historian Movses Khorenatsi ()."]}, {"y": 140, "e": "AD", "t": "year", "f": ["Emperor Antoninus Augustus Pius and Marcus Aurelius Caesar become Roman Consuls.", "Antoninus Pius recognizes the king of the Quadi, who becomes an ally of Rome.", "The export of olive oil from Hispania Baetica to Rome peaks.", "King Mithridates V dies; Vologases IV claims the throne and extends his rule throughout the Parthian Empire.", "Pope Pius I succeeds Pope Hyginus as the tenth pope of Rome according to tradition."]}, {"y": 141, "e": "AD", "t": "year", "f": ["The Temple of Antoninus and Faustina is constructed in Rome; the temple is dedicated to Empress Faustina the Elder.", "Last (6th) year of Yonghe era of the Chinese Han Dynasty.", "The  Lycia earthquake affects most of the Roman provinces of Lycia and Caria and the islands of Rhodes, Kos, Simi and Serifos. It triggers a severe tsunami, which causes major inundation.", "Change of Patriarch of Constantinople from Felix of Byzantium to Polycarpus II of Byzantium.", "th recorded perihelion passage of Halley's Comet."]}, {"y": 142, "e": "AD", "t": "year", "f": ["Emperor Antoninus Pius orders the construction of the Antonine Wall. The wall stretches  miles ( km), from Old Kilpatrick in West Dunbartonshire on the Firth of Clyde, to Carriden near Bo'ness on the Firth of Forth (Scotland). The Romans build  forts and smaller fortlets (milecastles), to protect the border against the Caledonians.", "Municipal doctors are named throughout the Roman Empire.", "First year of the Hanan era of the Chinese Han Dynasty.", "The Chinese Taoist alchemist Wei Boyang, author of the Kinship of the Three, is the first to describe an early form of gunpowder solution.", "Marcion proclaims that the Old Testament is incompatible with Christianity."]}, {"y": 143, "e": "AD", "t": "year", "f": ["Antoninus Pius serves as Roman Consul.", "A revolt of the Brigantes tribe in Britannia is suppressed by Quintus Lollius Urbicus.", "The Roman doctor Antyllus performs the first arteriotomy."]}, {"y": 144, "e": "AD", "t": "year", "f": ["Lucius Hedius Rufus Lollianus Avitus and Titus Statilius Maximus become Roman Consuls.", "The Roman campaigns in Mauretania begin.", "Change of era name from Hanan (3rd year) to Jiankang era of the Chinese Han dynasty.", "Change of emperor from Han Shundi to Han Chongdi of the Han dynasty.", "In Vietnam during the second Era of Northern Domination, rebellion of Cham people broke out in Jiaozhi and Jiuzhen. The rebels then surrendered to the Jiaozhi's governor in the same year."]}, {"y": 145, "e": "AD", "t": "year", "f": ["Antoninus Augustus Pius and Marcus Aurelius Caesar become Roman Consuls.", "Marcus Aurelius marries Faustina the Younger, the daughter of Antoninus Pius.", "Arrian becomes archon in Athens.", "Change of emperor from Han Chongdi to Han Zhidi of the Chinese Han dynasty."]}, {"y": 146, "e": "AD", "t": "year", "f": ["Faustina the Younger is given the title Augusta, and becomes Roman Empress.", "Marcus Aurelius receives the imperium proconsular.", "Change of era name from Yongxi (1st year) to Benchu era of the Chinese Han dynasty.", "Han Huandi succeeds Han Zhidi as emperor of the Chinese Han dynasty.", "Chadae becomes ruler of the Korean kingdom of Goguryeo."]}, {"y": 147, "e": "AD", "t": "year", "f": ["Marcus Aurelius receives imperial powers, from Emperor Antoninus Pius.", "Festivals to celebrate the 900th anniversary of the founding of Rome begin.", "King Vologases III dies after a -year reign, in which he has contended successfully with his rivals.", "King Vologases IV, son of Mithridates V of Parthia,  unites the Parthian Empire under his rule.", "First year of Jianhe of the Chinese Han Dynasty."]}, {"y": 148, "e": "AD", "t": "year", "f": ["Emperor Antoninus Pius hosts a series of grand games, to celebrate Rome's 900th anniversary.", "An Shigao arrives in China.", "Euzois succeeds Athendodorus, as Patriarch of Constantinople."]}, {"y": 150, "e": "AD", "t": "year", "f": ["The Roman town Forum Hadriani (Voorburg) receives the title of Municipium Aelium Cananefatium, \"the town of the Cananefates\" (modern Netherlands). The town is awarded with rights to organize markets.", "The Germans of the east move south, into the Carpathians and Black Sea area.", "The Albani appear in the Roman province of Macedonia, specifically in Epirus.", "First and only year of the \"Heping\" era of the Han dynasty in China.", "The Middle Culture period of Mayan civilization ends (approximate date)."]}, {"y": 151, "e": "AD", "t": "year", "f": ["Mytilene and Smyrna are destroyed by an earthquake.", "First year of Yuanjia of the Chinese Han dynasty.", "Detail from a rubbing of a stone relief in Wu family shrine (Wuliangci), Jiaxiang, Shandong, is made (Han dynasty)."]}, {"y": 154, "e": "AD", "t": "year", "f": ["King Eupator of Bosphorus pays tribute to Rome, due to the threat posed by the Alani.", "The Antonine Wall is completed.", "Last (2nd) year of Yongxing era of the Chinese Han Dynasty.", "Adalla becomes ruler of the Korean kingdom of Silla.", "Anicetus becomes pope of Rome (approximate date)."]}, {"y": 158, "e": "AD", "t": "year", "f": ["The earliest dated use of Sol Invictus, in a dedication from Rome.", "A revolt against Roman rule in Dacia is crushed.", "Change of era name from Yongshou to Yangxi of the Chinese Han dynasty."]}, {"y": 160, "e": "AD", "t": "year", "f": ["In Roman Empire, the Antonine Wall in Britain is retaken by Roman legions.", "In Jiuzhen (modern day Northern Vietnam) during the second Era of Northern Domination, a rebellion broke out but was swiftly quelled when the rebels surrendered to the newly appointed governor of Jiaozhi, who had previously governed the commandery in the 140s.", "In Rome, the manufacturing of soap containing grease, lime and ashes begins.", "Appian writes Ρωμαικα, known in English as the Roman History, in which he includes the history of each nation conquered up until the moment of its conquest.", "The first Buddhist monks arrive in China."]}, {"y": 161, "e": "AD", "t": "year", "f": ["March  – Emperor Antoninus Pius dies, and is succeeded by Marcus Aurelius, who shares imperial power with Lucius Verus, although Marcus retains the title Pontifex Maximus.", "Marcus Aurelius, a Spaniard like Trajan and Hadrian, is a stoical disciple of Epictetus, and an energetic man of action.  He pursues the policy of his predecessor and maintains good relations with the Senate. As a legislator, he endeavors to create new principles of morality and humanity, particularly favoring women and slaves.", "Aurelius reduces the weight of a goldpiece, the aureus, from . grams to . grams.", "Autumn – The Parthians invade Armenia, and install their own candidate on the throne. A legion (perhaps Legio IX Hispana) is destroyed at Elegeia.", "Gaius' Institutiones are published."]}, {"y": 164, "e": "AD", "t": "year", "f": ["Emperor Marcus Aurelius gives his daughter Lucilla in marriage to his co-emperor Lucius Verus.", "Avidius Cassius, one of Lucius Verus' generals, crosses the Euphrates and invades Parthia.", "Ctesiphon is captured by the Romans, but returns to the Parthians after the end of the war.", "The Antonine Wall in Scotland is abandoned by the Romans.", "Seleucia on the Tigris is destroyed."]}, {"y": 165, "e": "AD", "t": "year", "f": ["A Roman military expedition under Avidius Cassius is successful against Parthia, capturing Artaxata, Seleucia on the Tigris, and Ctesiphon. The Parthians sue for peace.", "Antonine Plague: A pandemic  breaks out in Rome, after the Roman army returns from Parthia. The plague significantly depopulates the Roman Empire and China.", "Legio II Italica is levied by Emperor Marcus Aurelius.", "Dura-Europos is taken by the Romans.", "The Romans establish a garrison at Doura Europos on the Euphrates, a control point for the commercial route to the Persian Gulf."]}, {"y": 166, "e": "AD", "t": "year", "f": ["Dacia is invaded by barbarians.", "Conflict erupts on the Danube frontier between Rome and the Germanic tribe of the Marcomanni.", "Emperor Marcus Aurelius appoints his sons Commodus and Marcus Annius Verus as co-rulers (Caesar), while he and Lucius Verus travel to Germany.", "End of the war with Parthia: The Parthians leave Armenia and eastern Mesopotamia, which both become Roman protectorates.", "A plague (possibly small pox) comes from the East and spreads throughout the Roman Empire, lasting for roughly twenty years."]}, {"y": 167, "e": "AD", "t": "year", "f": ["Lucius Aurelius Verus Augustus and Marcus Ummidius Quadratus Annianus become Roman Consuls.", "The Marcomanni tribe wages war against the Romans at Aquileia. They destroy aqueducts and irrigation conduits. Marcus Aurelius repels the invaders, ending the Pax Romana (Roman Peace) that has kept the Roman Empire free of conflict since the days of Emperor Augustus.", "The Vandals (Astingi and Lacringi) and the Sarmatian Iazyges invade Dacia. To counter them, Legio V Macedonica, returning from the Parthian War, moves its headquarters from Troesmis in Moesia Inferior to Potaissa in Dacia Porolissensis.", "The Germans devastate the Balkans and ransack the sanctuary of Eleusis, near Athens.", "Change of era name from Yanxi to Yongkang of the Chinese Han dynasty."]}, {"y": 168, "e": "AD", "t": "year", "f": ["Emperor Marcus Aurelius and his adopted brother Lucius Verus leave Rome, and establish their headquarters at Aquileia.", "The Roman army crosses the Alps into Pannonia, and subdues the Marcomanni at Carnuntum, north of the Danube.", "Emperor Ling of Han succeeds Emperor Huan of Han as the emperor of the Chinese Han Dynasty; the first year of the Jianning era."]}, {"y": 169, "e": "AD", "t": "year", "f": ["Marcomannic Wars: Germanic tribes invade the frontiers of the Roman Empire, specifically the provinces of Raetia and Moesia.", "Northern African Moors invade what is now Spain.", "Marcus Aurelius becomes sole Roman Emperor upon the death of Lucius Verus.", "Marcus Aurelius forces his daughter Lucilla into marriage with Claudius Pompeianus.", "Galen moves back to Rome for good."]}, {"y": 170, "e": "AD", "t": "year", "f": ["The Suebian tribes of the Marcomanni cross the Danube and invade Northern Italy. The Roman army (, men) is destroyed near Carnuntum in Pannonia.", "The Marcomanni plunder Opitergium (modern Oderzo) and besiege Aquileia. This is the first time hostile forces have entered Italy since .", "Emperor Marcus Aurelius writes in Sirmium (Pannonia) his first of  books of the Meditations in Koine Greek.", "The Costoboci cross the Danube (Dacia) and ravage Thrace in the Balkan Peninsula. They reach Eleusina, near Athens, and destroy the temple of the Eleusinian Mysteries.", "Marcus Aurelius orders humane treatment for Christians and slaves throughout the Roman Empire."]}, {"y": 171, "e": "AD", "t": "year", "f": ["Emperor Marcus Aurelius forms a new military command, the praetentura Italiae et Alpium. Aquileia is relieved, and the Marcomanni are evicted from Roman territory.", "Marcus Aurelius signs a peace treaty with the Quadi and the Sarmatian Iazyges. The Germanic tribes of the Hasdingi (Vandals) and the Lacringi become Roman allies.", "Armenia and Mesopotamia become protectorates of the Roman Empire.", "The Costoboci cross the Danube (Dacia) and ravage Thrace in the Balkan Peninsula. They reach Eleusis, near Athens, and destroy the temple of the Eleusinian Mysteries.", "May – June – Aelius Aristides, Greek orator, delivers a public speech in Smyrna, lamenting the damage recently inflicted to the sacred site of Eleusis."]}, {"y": 172, "e": "AD", "t": "year", "f": ["Emperor Marcus Aurelius crosses the Danube with an expeditionary force. He subdues the Marcomanni and their allies and then, in a pact signed with the Germanic tribes, he imports them into the Roman Empire to occupy areas that have been depopulated by the plague.", "The Sarmatians attack the lower Danube frontier.", "Miracle in Moravia: As the Roman army is encircled by the Quadi under intense heat, a violent thunderstorm sweeps away the Quadi in a torrent of water and mud, and refreshes the parched legionaries.", "Avidius Cassius, governor of Syria, suppresses an agrarian revolt in Egypt and is made supreme commander of the Roman army in the East.", "Last (5th) year of Jianning era and start of Xiping era of the Chinese Han dynasty."]}, {"y": 174, "e": "AD", "t": "year", "f": ["Empress Faustina the Younger accompanies her husband, Marcus Aurelius, on various military campaigns and enjoys the love of the Roman soldiers. Aurelius gives her the title of Mater Castrorum (\"Mother of the Camp\").", "Marcus Aurelius officially confers the title Fulminata (\"Thundering\") to the Legio XII Fulminata.", "Reign in India of Yajnashri Satakarni, Satavahana king of the Andhra. He extends his empire from the center to the north of India.", "Meditations by Marcus Aurelius is written, in Greek, while on military campaigns in Pannonia (approximate date).", "Pope Eleuterus succeeds Pope Soter as the thirteenth pope (approximate date)."]}, {"y": 175, "e": "AD", "t": "year", "f": ["Marcus Aurelius suppresses a revolt of Avidius Cassius, governor of Syria, after the latter proclaims himself emperor.", "Avidius Cassius fails in seeking support for his rebellion and is assassinated by Roman officers. They sent his head to Aurelius, who persuades the Senate to pardon Cassius's family.", "Commodus, son of Marcus Aurelius and his wife Faustina, is named Caesar.", "M. Sattonius Iucundus, decurio in Colonia Ulpia Traiana, restores the Thermae of Coriovallum (modern Heerlen). There are sources that state this happened in the .", "Confucian scholars try to ensure their capacity in the royal court of China.  They are massacred by the eunuchs."]}, {"y": 176, "e": "AD", "t": "year", "f": ["November  – Emperor Marcus Aurelius grants his son Commodus the rank of Imperator, and makes him Supreme Commander of the Roman legions.", "December  – Marcus Aurelius and Commodus enter Rome after a campaign north of the Alps, and receive a triumph for their victories over the Germanic tribes.", "The Equestrian Statue of Marcus Aurelius is made. It is now kept at Museo Capitolini in Rome (approximate date)."]}, {"y": 177, "e": "AD", "t": "year", "f": ["Lucius Aurelius Commodus Caesar (age ) and Marcus Peducaeus Plautius Quintillus become Roman Consuls.", "Commodus is given the title Augustus, and is made co-emperor, with the same status as his father, Marcus Aurelius.", "A systematic persecution of Christians begins in Rome; the followers take refuge in the catacombs.", "The churches in southern Gaul are destroyed after a crowd accuses the local Christians of practicing cannibalism.", "Forty-eight Christians are martyred in Lyon (Saint Blandina and Pothinus, bishop of Lyon, are among them)."]}, {"y": 178, "e": "AD", "t": "year", "f": ["Bruttia Crispina marries Commodus, and receives the title of Augusta.", "Emperor Marcus Aurelius and his son Commodus arrive at Carnuntum in Pannonia, and travel to the Danube to fight against the Marcomanni.", "Last (7th) year of Xiping era and start of Guanghe era of the Chinese Han dynasty.", "In India, the decline of the Kushan Empire begins.  The Sassanides take over Central Asia.", "In Hepu and Jiaozhi (modern day Northern Vietnam) during the second Era of Northern Domination, a rebellion led Liang Long broke out and last for three years until it was quelled by general Zhu Jun of the Han dynasty."]}, {"y": 179, "e": "AD", "t": "year", "f": ["The Roman fort Castra Regina (\"fortress by the Regen river\") is built at Regensburg, on the right bank of the Danube in Germany.", "Roman legionaries of Legio II Adiutrix engrave on the rock of the Trenčín Castle (Slovakia) the name of the town Laugaritio, marking the northernmost point of Roman presence in that part of Europe.", "Marcus Aurelius drives the Marcomanni over the Danube and reinforces the border. To repopulate and rebuild a devastated Pannonia, Rome allows the first German colonists to enter territory controlled by the Roman Empire.", "Abgar IX the Great becomes King of Edessa.", "Gogukcheon succeeds his father Shindae as King of Goguryeo."]}, {"y": 180, "e": "AD", "t": "year", "f": ["The Quadi are chased westwards, deeper into Germania. The Praetorian prefect, Tarutenius Paternus, achieves a decisive victory against the Germanic tribes.", "March  – Emperor Marcus Aurelius dies after a week's illness at his camp in Vindobona (modern Vienna). He is succeeded by his son Commodus (age ).", "The Era of the Five Good Emperors ends.", "Rome creates a -mile wide buffer zone by the Danube.", "Work begins in Rome on the building of the Column of Marcus Aurelius."]}, {"y": 181, "e": "AD", "t": "year", "f": ["Imperator Lucius Aurelius Commodus and Lucius Antistius Burrus become Roman Consuls.", "The Antonine Wall is overrun by the Picts in Britannia (approximate date).", "Nanhai inspector Kong Zhi led thousands of residents to join Liang Long's rebellion against the Han dynasty.", "June: Liang Long is captured and beheaded, and his rebellion is suppressed by general Zhu Juan.", "The volcano associated with Lake Taupō in New Zealand erupts, one of the largest on Earth in the last , years. The effects of this eruption are seen as far away as Rome and China."]}, {"y": 184, "e": "AD", "t": "year", "f": ["The Yellow Turban Rebellion and Liang Province Rebellion break out in China.", "The Disasters of the Partisan Prohibitions ends.", "Zhang Jue leads the peasant revolt against Emperor Ling of Han of the Eastern Han dynasty. Heading for the capital of Luoyang, his massive and undisciplined army (, men), burns and destroys government offices and outposts.", "June – Ling of Han places his brother-in-law, He Jin, in command of the imperial army and sends them to attack the Yellow Turban rebels.", "Winter – Zhang Jue dies of illness while his brothers Zhang Bao and Zhang Liang are killed in battles against Han imperial forces. The Yellow Turban rebels become scattered."]}, {"y": 185, "e": "AD", "t": "year", "f": ["Nobles of Britain demand that Emperor Commodus rescind all power given to Tigidius Perennis, who is eventually executed.", "Publius Helvius Pertinax is made governor of Britain and quells a mutiny of the British Roman legions who wanted him to become emperor. The disgruntled usurpers go on to attempt to assassinate the governor.", "Tigidius Perennis, his family and many others are executed for conspiring against Commodus.", "Commodus drains Rome's treasury to put on gladiatorial spectacles and confiscates property to support his pleasures. He participates as a gladiator and boasts of victory in , matches in the Circus Maximus.", "Zhi Yao, a Kushan Buddhist monk of Yuezhi ethnicity, translates Buddhist texts into the Chinese language during the Han dynasty."]}, {"y": 186, "e": "AD", "t": "year", "f": ["Peasants in Gaul stage an anti-tax uprising under Maternus.", "Roman governor Pertinax escapes an assassination attempt, by British usurpers.", "The Hatepe volcanic eruption extends Lake Taupō and makes skies red across the world. However, recent radiocarbon dating by R. Sparks has put the date at  ±  (% confidence)."]}, {"y": 187, "e": "AD", "t": "year", "f": ["Septimius Severus marries Julia Domna (age ), a Syrian princess, at Lugdunum (modern-day Lyon). She is the youngest daughter of high-priest Julius Bassianus – a descendant of the Royal House of Emesa. Her elder sister is Julia Maesa.", "Clodius Albinus defeats the Chatti, a highly organized German tribe that controlled the area that includes the Black Forest.", "Olympianus succeeds Pertinax as bishop of Byzantium (until )."]}]